english/vocabulary.org
#+OPTIONS: toc:1 ^:nil ~:nil num:nil reveal_title_slide:nil timestamp:nil
#+TAGS: AWL(a)

Record my english study process.
1. C represent less 1000 occur on youtube

* service
:PROPERTIES:
:EXPORT_FILE_NAME: service.md
:END:
通过公共服务把车送到检修的地方
** 语义
*** 公共服务
Workers in the emergency services are forbidden from striking.
*** 顾客服务
A wide range of financial services are available.
*** 服务
The service was terrrible and so was the food.
*** 服务业
*Mining* rose by 9.1%, manufacturing by 9.4% and services by 4.3%.
*** 工作
Brian retired after 25 years of service to the company.
*** 义务
Her attacker was sentenced to 120 hours' community service.
*** 宗教仪式
The service was held in the *chapel*.
*** 兵役
Maybe you should join the service.
*** 检修
I'm getting the bus home - my car's in for a service.
*** 发球
It's your service.
*** 服务站
How far is it to the next services?
*** 服侍
If a young woman did not have a *dowry*, she went into demestic service.
*** 班次
A bus service operates between Bolton and Salford.
*** 送达
the service of a summons
*** 维修
I'm having the car serviced next week.
*** 支持债息
Almost a quarter of the country's export earnings go to service a foreign debt of $29 billion.
** 短语
*** [#A] in service
There trains have been in service for many years.

https://youglish.com/getbyid/152058638/in%20service/english
*** out of service
The escalator is out of service.

https://youglish.com/getbyid/133868920/out%20of%20service/english
*** [#A] the service
Her son is in the service.

https://youglish.com/getbyid/102508712/the%20service/english
*** be of service
Can I be of any service?

https://youglish.com/getbyid/81196511/be%20of%20service/english
*** at your service
My secretary is at your service.

https://youglish.com/getbyid/124277631/at%20your%20service/english
